rishis11/stm32f407g_driver/stm32_f407g_drivers/drivers/Inc/stm32_f407g_gpio_driver.h
/*
 * stm32_f407g_gpio_driver.h
 *
 *  Created on: Feb 26, 2025
 *      Author: Rishi
 */

//THIS IS A DRIVER SPECIFIC HEADER FILE
#ifndef INC_STM32_F407G_GPIO_DRIVER_H_
#define INC_STM32_F407G_GPIO_DRIVER_H_

#include "stm32f407g.h"
//GPIO STRUCTURE TO HANDLE CONFIGURATION OF THE PINS, LIKE IT'S PINNUMBER,SPEED, ETC
typedef struct
{
	uint8_t GPIO_PinNumber;      //@GPIO_PINS
	uint8_t GPIO_PinMode;        //@GPIO_PIN_MODES -> SEARCH THIS NAME IN DOCUMENTATION. IT'LL NAVIGATE TO THE LIST OF AVAILABLE MODES
	uint8_t GPIO_PinSpeed;    //@GPIO_PIN_SPEED
	uint8_t GPIO_PinPuPdControl;   //@GPIO_PU_PD
	uint8_t GPIO_PinOPType;   ////@GPIO_PIN_OUT
	uint8_t GPIO_PinAltFunMode;
}GPIO_PinConfig_t;

typedef struct
{
	GPIO_RegDef_t *pGPIOx;
	GPIO_PinConfig_t GPIO_PinConfig;
}GPIO_Handle_t;

//@GPIO_PINS
//AVAILABLE GPIO PINS
#define GPIO_PIN_NO_0  				0
#define GPIO_PIN_NO_1  				1
#define GPIO_PIN_NO_2  				2
#define GPIO_PIN_NO_3  				3
#define GPIO_PIN_NO_4  				4
#define GPIO_PIN_NO_5  				5
#define GPIO_PIN_NO_6  				6
#define GPIO_PIN_NO_7  				7
#define GPIO_PIN_NO_8  				8
#define GPIO_PIN_NO_9  				9
#define GPIO_PIN_NO_10  			10
#define GPIO_PIN_NO_11 				11
#define GPIO_PIN_NO_12  			12
#define GPIO_PIN_NO_13 				13
#define GPIO_PIN_NO_14 				14
#define GPIO_PIN_NO_15 				15




//@GPIO_PIN_MODES
//POSSIBLE MODES FOR CONFIGURATION GPIO PINS
#define GPIO_MODE_IN 		0
#define GPIO_MODE_OUT 		1
#define GPIO_MODE_ALTFN 	2
#define GPIO_MODE_ANALOG 	3
//THE BELOW MODES ARE USER DEFINED FOR IQR. ABOVE MODES ARE DERVED FROM MCU REFERENCE MANUAL.
#define GPIO_MODE_IT_FT     4
#define GPIO_MODE_IT_RT     5
#define GPIO_MODE_IT_RFT    6

//@GPIO_PIN_OUT
//GPIO pin possible output types
#define GPIO_OP_TYPE_PP   0
#define GPIO_OP_TYPE_OD   1


//@GPIO_PIN_SPEED
//GPIO pin possible output speeds
#define GPIO_SPEED_LOW			0
#define GPIO_SPEED_MEDIUM		1
#define GPIO_SPEED_FAST			2
#define GPOI_SPEED_HIGH			3

//@GPIO_PU_PD
//GPIO pin pull up AND pull down configuration macros

#define GPIO_NO_PUPD   		0
#define GPIO_PIN_PU			1
#define GPIO_PIN_PD			2

//Creating APIs i.e functions for the following functions

//Peripheral Clock setup

void GPIO_PeriClockControl(GPIO_RegDef_t *pGPIOx, uint8_t EnorDi);


//Init and De-init

void GPIO_Init(GPIO_Handle_t *pGPIOHandle);
void GPIO_DeInit(GPIO_RegDef_t *pGPIOx);



//Data read and write

uint8_t GPIO_ReadFromInputPin(GPIO_RegDef_t *pGPIOx, uint8_t PinNumber);
uint16_t GPIO_ReadFromInputPort(GPIO_RegDef_t *pGPIOx);
void GPIO_WriteToOutputPin(GPIO_RegDef_t *pGPIOx, uint8_t PinNumber, uint8_t Value);
void GPIO_WriteToOutputPort(GPIO_RegDef_t *pGPIOx, uint16_t Value);
void GPIO_ToggleOutputPin(GPIO_RegDef_t *pGPIOx, uint8_t PinNumber);

//IRQ Configuration and ISR handling

void GPIO_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi);
void GPIO_IRQPriorityConfig(uint8_t IRQNumber, uint32_t IRQPriority);
void GPIO_IRQHandling(uint8_t PinNumber);



#endif
